Revit 2027 API
BuiltInFailures.FamilyFailures.ElementTypeParameterized Property
 The type(s) of the selected element(s) are driven by family parameter(s). Changing the type directly will break the association.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementTypeParameterized { get; }
Public Shared ReadOnly Property ElementTypeParameterized As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementTypeParameterized {
	FailureDefinitionId^ get ();
}
static member ElementTypeParameterized : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace